# Lab | Data Cleaning and Formatting

In this lab, we will be working with the customer data from an insurance company, which can be found in the CSV file located at the following link: https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

# Challenge 1: Data Cleaning and Formatting

## Exercise 1: Cleaning Column Names

To ensure consistency and ease of use, standardize the column names of the dataframe. Start by taking a first look at the dataframe and identifying any column names that need to be modified. Use appropriate naming conventions and make sure that column names are descriptive and informative.

*Hint*:
- *Column names should be in lower case*
- *White spaces in column names should be replaced by `_`*
- *`st` could be replaced for `state`*

In [1]:
import pandas as pd

url = 'https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv'
insur_df = pd.read_csv(url)

insur_df.head()

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [2]:
# standardize column names

new_columns = [name.lower().replace(' ','_') for name in insur_df.columns]
insur_df.columns = new_columns
insur_df = insur_df.rename(columns={'st': 'state','customer_lifetime_value':'clv',
                                    'monthly_premium_auto':'monthly_prem','number_of_open_complaints':'open_complaints',
                                    'total_claim_amount':'total_claim_amt'
                                   })

#insur_df.columns = ['customer', 'state', 'gender', 'education', 'clv', 'income', 'monthly_prem', 'open_complaints', 'policy_type', 'vehicle_class', 'total_claim_amt']
insur_df.head()

,customer,state,gender,education,clv,income,monthly_prem,open_complaints,policy_type,vehicle_class,total_claim_amt
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

## Exercise 2: Cleaning invalid Values

The dataset contains columns with inconsistent and incorrect values that could affect the accuracy of our analysis. Therefore, we need to clean these columns to ensure that they only contain valid data.

Note that this exercise will focus only on cleaning inconsistent values and will not involve handling null values (NaN or None).

*Hint*:
- *Gender column contains various inconsistent values such as "F", "M", "Femal", "Male", "female", which need to be standardized, for example, to "M" and "F".*
- *State abbreviations be can replaced with its full name, for example "AZ": "Arizona", "Cali": "California", "WA": "Washington"*
- *In education, "Bachelors" could be replaced by "Bachelor"*
- *In Customer Lifetime Value, delete the `%` character*
- *In vehicle class, "Sports Car", "Luxury SUV" and "Luxury Car" could be replaced by "Luxury"*

In [3]:
# clean gender column

insur_df['gender'].unique()
insur_df['gender'].replace(['Femal','female','Male'],['F','F','M'],inplace=True)
insur_df.head()

,customer,state,gender,education,clv,income,monthly_prem,open_complaints,policy_type,vehicle_class,total_claim_amt
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [4]:
# clean state abbreviations

insur_df['state'].unique()
insur_df['state'].replace(['WA','AZ','Cali'],['Washington','Arizona','California'], inplace=True)
insur_df['state'].unique()

array(['Washington', 'Arizona', 'Nevada', 'California', 'Oregon', nan],
      dtype=object)

In [5]:
# clean education

insur_df['education'].unique()
insur_df['education'].replace('Bachelor','Bachelors',inplace=True)
insur_df['education'].unique()

array(['Master', 'Bachelors', 'High School or Below', 'College', 'Doctor',
       nan], dtype=object)

In [6]:
insur_df['clv'] = insur_df['clv'].str.slice(stop=-1)
insur_df['clv'].head()

0           NaN
1     697953.59
2    1288743.17
3     764586.18
4     536307.65
Name: clv, dtype: object

In [8]:
insur_df['vehicle_class'].unique()
insur_df['vehicle_class'].replace(['Luxury SUV','Sports Car','Luxury Car'],['Luxury','Luxury','Luxury'],inplace=True)
insur_df['vehicle_class'].unique()

array(['Four-Door Car', 'Two-Door Car', 'SUV', 'Luxury', nan],
      dtype=object)

## Exercise 3: Formatting data types

The data types of many columns in the dataset appear to be incorrect. This could impact the accuracy of our analysis. To ensure accurate analysis, we need to correct the data types of these columns. Please update the data types of the columns as appropriate.

It is important to note that this exercise does not involve handling null values (NaN or None).

*Hint*:
- *Customer lifetime value should be numeric*
- *Number of open complaints has an incorrect format. Look at the different values it takes with `unique()` and take the middle value. As an example, 1/5/00 should be 5. Number of open complaints is a string - remember you can use `split()` to deal with it and take the number you need. Finally, since it should be numeric, cast the column to be in its proper type.*

In [9]:
insur_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4008 entries, 0 to 4007
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   customer         1071 non-null   object
 1   state            1071 non-null   object
 2   gender           954 non-null    object
 3   education        1071 non-null   object
 4   clv              1068 non-null   object
 5   income           1071 non-null   float64
 6   monthly_prem     1071 non-null   float64
 7   open_complaints  1071 non-null   object
 8   policy_type      1071 non-null   object
 9   vehicle_class    1071 non-null   object
 10  total_claim_amt  1071 non-null   float64
dtypes: float64(3), object(8)
memory usage: 344.6+ KB

In [10]:
insur_df.clv = insur_df.clv.astype(float)
insur_df.info()

# can use to_numeric

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4008 entries, 0 to 4007
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   customer         1071 non-null   object
 1   state            1071 non-null   object
 2   gender           954 non-null    object
 3   education        1071 non-null   object
 4   clv              1068 non-null   float64
 5   income           1071 non-null   float64
 6   monthly_prem     1071 non-null   float64
 7   open_complaints  1071 non-null   object
 8   policy_type      1071 non-null   object
 9   vehicle_class    1071 non-null   object
 10  total_claim_amt  1071 non-null   float64
dtypes: float64(4), object(7)
memory usage: 344.6+ KB

In [11]:
insur_df.open_complaints.unique()
insur_df.open_complaints = insur_df.open_complaints.str.slice(2,3)
insur_df.open_complaints.unique()

# consider apply() with lambda function to handle more complex cases 
# where there are many different data types and different formats

array(['0', '2', '1', '3', '5', '4', nan], dtype=object)

## Exercise 4: Dealing with Null values

Identify any columns with null or missing values. Identify how many null values each column has. You can use the `isnull()` function in pandas to find columns with null values.

Decide on a strategy for handling the null values. There are several options, including:

- Drop the rows or columns with null values
- Fill the null values with a specific value (such as the column mean or median for numerical variables, and mode for categorical variables)
- Fill the null values with the previous or next value in the column
- Fill the null values based on a more complex algorithm or model (note: we haven't covered this yet)

Implement your chosen strategy to handle the null values. You can use the `fillna()` function in pandas to fill null values or `dropna()` function to drop null values.

Verify that your strategy has successfully handled the null values. You can use the `isnull()` function again to check if there are still null values in the dataset.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling null values.

After formatting data types, as a last step, convert all the numeric variables to integers.

In [12]:
insur_df.head()

,customer,state,gender,education,clv,income,monthly_prem,open_complaints,policy_type,vehicle_class,total_claim_amt
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,0,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelors,697953.59,0.0,94.0,0,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelors,1288743.17,48767.0,108.0,0,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelors,764586.18,0.0,106.0,0,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65,36357.0,68.0,0,Personal Auto,Four-Door Car,17.269323

In [13]:
insur_df.isnull()

,customer,state,gender,education,clv,income,monthly_prem,open_complaints,policy_type,vehicle_class,total_claim_amt
0,False,False,True,False,True,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...
4003,True,True,True,True,True,True,True,True,True,True,True
4004,True,True,True,True,True,True,True,True,True,True,True
4005,True,True,True,True,True,True,True,True,True,True,True
4006,True,True,True,True,True,True,True,True,True,True,True
4007,True,True,True,True,True,True,True,True,True,True,True

In [14]:
insur_df.isnull().sum()

customer           2937
state              2937
gender             3054
education          2937
clv                2940
income             2937
monthly_prem       2937
open_complaints    2937
policy_type        2937
vehicle_class      2937
total_claim_amt    2937
dtype: int64

In [15]:
insur_df.vehicle_class.unique()

array(['Four-Door Car', 'Two-Door Car', 'SUV', 'Luxury', nan],
      dtype=object)

In [16]:
insur_df.policy_type.unique()

array(['Personal Auto', 'Corporate Auto', 'Special Auto', nan],
      dtype=object)

In [17]:
insur_df.dropna(subset=['customer','state','clv','income','monthly_prem','vehicle_class','policy_type'],inplace=True)

In [18]:
insur_df.customer = insur_df.customer.fillna('unavailable')
insur_df.state.ffill(inplace=True)
insur_df.gender.fillna('D',inplace=True)
insur_df.education.fillna('Undefined',inplace=True)
insur_df.clv.fillna(insur_df.clv.mean(),inplace=True)
insur_df.income.fillna(insur_df.income.median(),inplace=True)
insur_df.monthly_prem.fillna(insur_df.monthly_prem.median(),inplace=True)
insur_df.open_complaints.fillna(insur_df.open_complaints.median(),inplace=True)
insur_df.vehicle_class.fillna('Undefined',inplace=True)
insur_df.total_claim_amt.fillna(insur_df.total_claim_amt.mean(),inplace=True)
insur_df.policy_type.fillna('Undefined',inplace=True)

#pol_condition1 = ['vehicle_class' == 'Four-Door Car' or 'Two-Door Car']
#pol_condition2 = ['vehicle_class' == 'SUV']
#pol_condition3 = ['vehicle_class' == 'Luxury']

#insur_df['policy_type'][pol_condition1].fillna('Personal Auto', inplace=True)
#insur_df['policy_type'][pol_condition2].fillna('Corporate Auto', inplace=True)
#insur_df['policy_type'][pol_condition3].fillna('Special Auto', inplace=True)

In [19]:
insur_df.isnull().sum()

customer           0
state              0
gender             0
education          0
clv                0
income             0
monthly_prem       0
open_complaints    0
policy_type        0
vehicle_class      0
total_claim_amt    0
dtype: int64

In [20]:
insur_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1068 entries, 1 to 1070
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   customer         1068 non-null   object
 1   state            1068 non-null   object
 2   gender           1068 non-null   object
 3   education        1068 non-null   object
 4   clv              1068 non-null   float64
 5   income           1068 non-null   float64
 6   monthly_prem     1068 non-null   float64
 7   open_complaints  1068 non-null   object
 8   policy_type      1068 non-null   object
 9   vehicle_class    1068 non-null   object
 10  total_claim_amt  1068 non-null   float64
dtypes: float64(4), object(7)
memory usage: 100.1+ KB

In [21]:
insur_df.clv = insur_df.clv.astype(int)
insur_df.income = insur_df.income.astype(int)
insur_df.monthly_prem = insur_df.monthly_prem.astype(int)
insur_df.total_claim_amt = insur_df.total_claim_amt.astype(int)

In [22]:
insur_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1068 entries, 1 to 1070
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   customer         1068 non-null   object
 1   state            1068 non-null   object
 2   gender           1068 non-null   object
 3   education        1068 non-null   object
 4   clv              1068 non-null   int64
 5   income           1068 non-null   int64
 6   monthly_prem     1068 non-null   int64
 7   open_complaints  1068 non-null   object
 8   policy_type      1068 non-null   object
 9   vehicle_class    1068 non-null   object
 10  total_claim_amt  1068 non-null   int64
dtypes: int64(4), object(7)
memory usage: 100.1+ KB

## Exercise 5: Dealing with duplicates

Use the `.duplicated()` method to identify any duplicate rows in the dataframe.

Decide on a strategy for handling the duplicates. Options include:
- Dropping all duplicate rows
- Keeping only the first occurrence of each duplicated row
- Keeping only the last occurrence of each duplicated row
- Dropping duplicates based on a subset of columns
- Dropping duplicates based on a specific column

Implement your chosen strategy using the `drop_duplicates()` function.

Verify that your strategy has successfully handled the duplicates by checking for duplicates again using `.duplicated()`.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling duplicates.

Save the cleaned dataset to a new CSV file.

*Hint*: *after dropping duplicates, reset the index to ensure consistency*.

In [23]:
insur_df.duplicated().sum()

0

In [24]:
insur_df.drop_duplicates(
    subset=['customer','clv','income','monthly_prem','open_complaints','vehicle_class','total_claim_amt'],
    inplace=True)

In [25]:
insur_df.duplicated().sum()

0

In [26]:
insur_df.tail()

,customer,state,gender,education,clv,income,monthly_prem,open_complaints,policy_type,vehicle_class,total_claim_amt
1066,TM65736,Oregon,M,Master,305955,38644,78,1,Personal Auto,Four-Door Car,361
1067,VJ51327,California,F,High School or Below,2031499,63209,102,2,Personal Auto,SUV,207
1068,GS98873,Arizona,F,Bachelors,323912,16061,88,0,Personal Auto,Four-Door Car,633
1069,CW49887,California,F,Master,462680,79487,114,0,Special Auto,SUV,547
1070,MY31220,California,F,College,899704,54230,112,0,Personal Auto,Two-Door Car,537

In [28]:
insur_df.to_csv('insur_df.csv', index=False)
insur_df

,customer,state,gender,education,clv,income,monthly_prem,open_complaints,policy_type,vehicle_class,total_claim_amt
1,QZ44356,Arizona,F,Bachelors,697953,0,94,0,Personal Auto,Four-Door Car,1131
2,AI49188,Nevada,F,Bachelors,1288743,48767,108,0,Personal Auto,Two-Door Car,566
3,WW63253,California,M,Bachelors,764586,0,106,0,Corporate Auto,SUV,529
4,GA49547,Washington,M,High School or Below,536307,36357,68,0,Personal Auto,Four-Door Car,17
5,OC83172,Oregon,F,Bachelors,825629,62902,69,0,Personal Auto,Two-Door Car,159
...,...,...,...,...,...,...,...,...,...,...,...
1066,TM65736,Oregon,M,Master,305955,38644,78,1,Personal Auto,Four-Door Car,361
1067,VJ51327,California,F,High School or Below,2031499,63209,102,2,Personal Auto,SUV,207
1068,GS98873,Arizona,F,Bachelors,323912,16061,88,0,Personal Auto,Four-Door Car,633
1069,CW49887,California,F,Master,462680,79487,114,0,Special Auto,SUV,547
1070,MY31220,California,F,College,899704,54230,112,0,Personal Auto,Two-Door Car,537

# Bonus: Challenge 2: creating functions on a separate `py` file

Put all the data cleaning and formatting steps into functions, and create a main function that performs all the cleaning and formatting.

Write these functions in separate .py file(s). By putting these steps into functions, we can make the code more modular and easier to maintain.

*Hint: autoreload module is a utility module in Python that allows you to automatically reload modules in the current session when changes are made to the source code. This can be useful in situations where you are actively developing code and want to see the effects of changes you make without having to constantly restart the Python interpreter or Jupyter Notebook kernel.*

In [ ]:
# Your code here

# Bonus: Challenge 3: Analyzing Clean and Formated Data

You have been tasked with analyzing the data to identify potential areas for improving customer retention and profitability. Your goal is to identify customers with a high policy claim amount and a low customer lifetime value.

In the Pandas Lab, we only looked at high policy claim amounts because we couldn't look into low customer lifetime values. If we had tried to work with that column, we wouldn't have been able to because customer lifetime value wasn't clean and in its proper format. So after cleaning and formatting the data, let's get some more interesting insights!

Instructions:

- Review the statistics again for total claim amount and customer lifetime value to gain an understanding of the data.
- To identify potential areas for improving customer retention and profitability, we want to focus on customers with a high policy claim amount and a low customer lifetime value. Consider customers with a high policy claim amount to be those in the top 25% of the total claim amount, and clients with a low customer lifetime value to be those in the bottom 25% of the customer lifetime value. Create a pandas DataFrame object that contains information about customers with a policy claim amount greater than the 75th percentile and a customer lifetime value in the bottom 25th percentile.
- Use DataFrame methods to calculate summary statistics about the high policy claim amount and low customer lifetime value data. To do so, select both columns of the dataframe simultaneously and pass it to the `.describe()` method. This will give you descriptive statistics, such as mean, median, standard deviation, minimum and maximum values for both columns at the same time, allowing you to compare and analyze their characteristics.

In [ ]:
# Your code here